import "../AboutMe/aboutme.css";

const Aboutme = () => {
  return (
    <div className="container">
      <a className="about-logo" href="/">
        I<span>Smart</span>
      </a>
      <div className="about">
        <div className="phones">
          <h1>Հեռախոսներ</h1>
          <p>
            Մեր առցանց խանութը առաջարկում է լայն ընտրանի հեռախոսների՝ ներառյալ
            նորագույն մոդելները ամենահայտնի ապրանքանիշներից։ Մենք ունենք
            սմարթֆոններ տարբեր հնարավորություններով և դիզայնով, որպեսզի
            կարողանաք գտնել այն, ինչ համապատասխանում է ձեր պահանջներին։ Մեր
            հեռախոսները ունեն բարձր որակի տեսախցիկներ, մեծ բարձորակ էկրաններ և
            մեծ հզորություն, որը թույլ է տալիս անխափան աշխատել։
          </p>
          <ul>
            <li>
              Անվտանգության նորագույն միջոցառումներ՝ մատնահետքի ճանաչում, դեմքի
              ճանաչում <i class="bi bi-check-lg"></i>
            </li>
            <li>
              Բարձր հզորություն և արագագործություն{" "}
              <i class="bi bi-check-lg"></i>
            </li>
            <li>
              Լայն տեսականու տեսախցիկներ <i class="bi bi-check-lg"></i>
            </li>
            <li>
              Երկարատև մարտկոցների կյանք <i class="bi bi-check-lg"></i>
            </li>
          </ul>
        </div>
        <div className="notebook">
          <h1>Նոթբուքներ</h1>
          <p>
            Մեր խանութը առաջարկում է նորագույն նոթբուքները՝ նախատեսված ինչպես
            աշխատանքի, այնպես էլ խաղերի համար։ Մեր նոթբուքները հագեցած են հզոր
            պրոցեսորներով, մեծ RAM-ով և հզոր տեսախցիկներով, որոնք ապահովում են
            արագ և հուսալի աշխատանք։ Կապվեք մեզ հետ, որպեսզի գտնեք նոթբուքը, որը
            կհամապատասխանի ձեր բոլոր պահանջներին և կօգնի իրականացնել ձեր
            նպատակները։
          </p>
          <ul>
            <li>Հզոր պրոցեսորներ՝ բարձր արդյունավետության համար</li>
            <li>Բարձր հզորության RAM՝ բազմաբնույթ աշխատանքի համար</li>
            <li>Բարձր որակի էկրաններ՝ վառ գույներով և բարձր լուծաչափով</li>
            <li>Երկարատև մարտկոցների կյանք՝ անխափան աշխատանքի համար</li>
          </ul>
        </div>
      </div>
      <div className="contact">
        <div className="map">
        <iframe
          src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d1524.410971958213!2d44.443395790915666!3d40.16851794502733!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x406abdde8cbb4cf1%3A0x69ac32604f9c1e2!2sMSKH%20college!5e0!3m2!1sru!2sam!4v1718553240340!5m2!1sru!2sam"
          width="600"
          height="450"
          style={{ border: 0 }}
          allowFullScreen=""
          loading="lazy"
          referrerPolicy="no-referrer-when-downgrade"
        ></iframe>
        </div>
        <div className="numbers">
            <p> <i class="bi bi-geo-alt-fill kd"></i>Հասցե` Հայաստան, Երևան, Հարավարևմտյան զանգված, Րաֆֆու 57</p>
            <p><i class="bi bi-telephone-fill kd"></i> Հեռ` +374 (10) 74 72 46 բջջ՝ +374 (91) 43 10 99</p>
            <p><i class="bi bi-envelope kd"></i> Էլ. փոստ` info@mskh.am</p>
        </div>
      </div>
    </div>
  );
};

export default Aboutme;
